authenticate-me/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]
---
  def self.find_by_credentials(credential, password)
    user = User.find_by(email: credential) || User.find_by(username: credential)