authenticate-me/app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    email = params.require(:email)
    username = params.require(:username)
    password = params.require(:password)

    @user = User.new(email: email, username: username, password: password)

    if @user.save